Repository: antoniocdff/django-shape-engine
Catalog: shape_engine/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Error while processing the shapefile, the file is corrupted.
pt_br: Erro ao processar o shapefile, o arquivo está corrompido.

source: There aren't any fields to map.
pt_br: Não há nenhum campo para ser mapeado.

source: Don't import
pt_br: Não Importar

source: Field on the shapefile to be used as the value for '{}'
pt_br: Campo no shapefile que será usado como valor para '{}'

source: Compressed shapefile, must contain the .shp, .shx, .dbf and .prj files
pt_br: Shapefile compactado, precisa conter os arquivos .shp, .shx, .dbf e .prj

source: Finished?
pt_br: Finalizada?

source: Indicates wether or not the import of the shapefile.is finished (False means there's something pending, such as choosing the fields to map to).
pt_br: Inda se a importação do shapefile já foi finalizada. (Falso indica que há algo pendente, como escolher os campos para mapear os dados).

source: Created at
pt_br: Criado em

source: FID of the feature in the shapefile.
pt_br: FID da feição no shapefile.

source: Handler must inherit from ShapefileHandler
pt_br: O Handler precisa herdar a classe ShapefileHandler

source: Unrecognized file type.
pt_br: Tipo de arquivo não reconhecido.

source: Invalid zip file, it's either corrupted or not a zip.
pt_br: Arquivo zip inválido. Está corrompido ou não é um zip.

source: The files are not all from the same shapefile.
pt_br: Os arquivos não são todos do mesmo shapefile.

source: The following files are missing in the shapefile: {}
pt_br: Os seguintes arquivos estão faltando no shapefile: {}
